namespace Task2
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}

//Создайте класс Спектакль. Класс должен хранить такую информацию:
//- Название спектакля
//- Название театра
//- Жанр
//- Длительность
//- Список актёров
//Реализуйте в классе методы и свойства, необходимые для функционирования класса.
//Класс должен реализовывать интерфейс IDisposable. Напишите код для тестирования функциональности класса.
//Напишите код для вызова метода Dispose.